modules/policy/src/test/resources/com/l7tech/policy/resources/samltokenprofile/R6604_failure_01.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
    xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsse:Security>
            <wsse:SecurityTokenReference>
                <!-- Invalid use of EncodingType -->
                <wsse:KeyIdentifier ValueType='http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.0#SAMLAssertionID'
                                    EncodingType="xs:string">
                  keyidhere
                </wsse:KeyIdentifier>
            </wsse:SecurityTokenReference>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <tns:listProducts xmlns:tns="http://warehouse.acme.com/ws"/>
    </soap:Body>
</soap:Envelope>
